#include <stdio.h>
#define MONTH 12
#define YEARS 5
int main()
{
    const float rain[YEARS][MONTH] = // 内含5个数组元素的数组，每个数组元素内含12个float类型的元素
        /*拆开来看：rain[5]表明rain是一个内含5个元素的数组
                   float[12]是一个内含12个float类型元素的数组*/
        {
            {4.3, 4.3, 4.3, 3.0, 2.0, 1.2, 0.2, 0.2, 0.4, 2.4, 3.5, 6.6}, // 2010年的降水量
            {8.5, 8.2, 1.2, 1.6, 2.4, 0.0, 0.0, 0.0, 4.3, 3.5, 8.5, 6.6}, // 2011年的降水量
            {9.1, 8.5, 6.7, 4.3, 2.4, 0.0, 0.0, 0.0, 4.3, 3.5, 8.5, 6.6}, // 2012年的降水量
            {9.1, 8.5, 6.7, 4.3, 2.4, 0.0, 0.0, 0.0, 4.3, 3.5, 8.5, 6.6}, // 2013年的降水量
            {9.1, 8.5, 6.7, 4.3, 2.4, 0.0, 0.0, 0.0, 4.3, 3.5, 8.5, 6.6}  // 2014年的降水量
        };
    for (size_t i = 0; i < YEARS; i++)
    {
        for (size_t j = 0; j < MONTH; j++)
        {
            printf("%.1f ", rain[i][j]);
        }
        printf("\n");
    }
    return 0;
}